notes/meeting_2021jun13.org
* meeting notes June 20, 2021
** and now, for something completely different

*** TODO is it possible to just mail "SUBSCRIBE" to documentation@raku.org

** minutes of last meeting
**** sorting and comparators documentation
*** junctions
**** basics (we've talked about them before)
***** /home/doom/End/Cave/Perl6/Wall/raku-study/notes/junctions
***** https://www.nntp.perl.org/group/perl.perl6.users/2020/06/msg8870.html

*** follow-up: trying to pass a junction as an argument
**** File::Find exclude
***** https://www.nntp.perl.org/group/perl.perl6.users/2021/05/msg9917.html
***** https://github.com/doomvox/raku-study/tree/main/bin/2021may30/file_find_with_junction_as_exclude.raku
**** Ralph Mellor conceeds junction "precedence" can be confusing... 
***** TODO (( link from mailing list ))

**** TODO opened/found issue: raku's perl5 regex compatibility (:P5) can't handle (?^i:
***** https://www.nntp.perl.org/group/perl.perl6.users/2021/05/msg9924.html

** other topic ideas
*** raku classes as data containers (joe brenner) 
**** https://github.com/doomvox/raku-study/tree/main/bin/2021may16/data_container_class_iii.raku
***** spots example
****** schema: /home/doom/End/Cave/GraphVizDbiGeneral/Wall/graphs/schema_diagram.png
******* generated with: /home/doom/End/Cave/GraphVizDbiGeneral/bin/generate_schema_diagram_spots
****** https://github.com/doomvox/raku-study/tree/main/bin/2021may30/spots_data_container_class.raku

*** unusual argument passing signatures (joe brenner)
**** /home/doom/End/Cave/Ice/Xtal/Perl6/passing_args.org
**** /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021may02/mixing_named_args_and_positional_ones.raku

*** bruce gray rosettacode
**** http://rosettacode.org/wiki/Coprime_triplets#Raku
**** https://rosettacode.org/wiki/Tree_from_nesting_levels#Raku 

*** super flat 
**** https://stackoverflow.com/questions/67515479/what-is-a-simple-and-elegant-way-to-flatten-lists-or-arrays-of-arbitrary-depths
**** https://stackoverflow.com/questions/41648119/how-can-i-completely-flatten-a-list-of-lists-of-lists
**** https://en.wikipedia.org/wiki/Superflat

*** type system: what is accepted by what   
**** is anything ever cast automatically
***** when can you Cool

*** go through my perl5 templates: how much is core raku now?

*** raku die handlers vs perl5
*** raku idioms
**** https://github.com/doomvox/raku-study/blob/main/notes/idioms.org

***** maybe: favor methods over functions?

** appendix: the usual links
*** code examples
https://github.com/doomvox/raku-study/tree/main/bin/2021jun20
*** meeting notes (material from this file)
https://github.com/doomvox/raku-study/tree/main/notes/meeting_2021jun20.md
*** SF Perl page, has links to mailing list
http://sf.pm.org/
*** perl6-users mailing list archive
https://www.nntp.perl.org/group/perl.perl6.users/

** announcments
*** next meeting: July 11th


*** "conference in the clouds" coming up (bruce gray talk, etc)
**** june 8-10th, $10
