notes/meeting_2021jun13.md
- [meeting notes June 20, 2021](#org9df4d32)
  - [and now, for something completely different](#orgb957bdf)
    - [is it possible to just mail "SUBSCRIBE" to documentation@raku.org](#org8583e2d)
  - [minutes of last meeting](#orga6e7455)
    - [junctions](#org583a021)
    - [follow-up: trying to pass a junction as an argument](#orgb9e196a)
  - [other topic ideas](#org2585c12)
    - [raku classes as data containers (joe brenner)](#org57fba2a)
    - [unusual argument passing signatures (joe brenner)](#orgbf1980e)
    - [bruce gray rosettacode](#org83b5560)
    - [super flat](#org2048fd7)
    - [type system: what is accepted by what](#orgfac2b47)
    - [go through my perl5 templates: how much is core raku now?](#org19a3547)
    - [raku die handlers vs perl5](#org20b9652)
    - [raku idioms](#org260be63)
  - [appendix: the usual links](#orgba97dcc)
    - [code examples](#orgd1a27c5)
    - [meeting notes (material from this file)](#org6671f9b)
    - [SF Perl page, has links to mailing list](#orgc4602cf)
    - [perl6-users mailing list archive](#orge7d6445)
  - [announcments](#org6444485)
    - [next meeting: July 11th](#orge281b1a)
    - ["conference in the clouds" coming up (bruce gray talk, etc)](#orgbcb53ec)


<a id="org9df4d32"></a>

# meeting notes June 20, 2021


<a id="orgb957bdf"></a>

## and now, for something completely different


<a id="org8583e2d"></a>

### is it possible to just mail "SUBSCRIBE" to documentation@raku.org


<a id="orga6e7455"></a>

## minutes of last meeting

1.  sorting and comparators documentation


<a id="org583a021"></a>

### junctions

1.  basics (we've talked about them before)

    1.  /home/doom/End/Cave/Perl6/Wall/raku-study/notes/junctions
    
    2.  <https://www.nntp.perl.org/group/perl.perl6.users/2020/06/msg8870.html>


<a id="orgb9e196a"></a>

### follow-up: trying to pass a junction as an argument

1.  <:Find> exclude

    1.  <https://www.nntp.perl.org/group/perl.perl6.users/2021/05/msg9917.html>
    
    2.  <https://github.com/doomvox/raku-study/tree/main/bin/2021may30/file_find_with_junction_as_exclude.raku>

2.  Ralph Mellor conceeds junction "precedence" can be confusing&#x2026;

    1.  TODO (( link from mailing list ))

3.  TODO opened/found issue: raku's perl5 regex compatibility (:P5) can't handle (?<sup>i</sup>:

    1.  <https://www.nntp.perl.org/group/perl.perl6.users/2021/05/msg9924.html>


<a id="org2585c12"></a>

## other topic ideas


<a id="org57fba2a"></a>

### raku classes as data containers (joe brenner)

1.  <https://github.com/doomvox/raku-study/tree/main/bin/2021may16/data_container_class_iii.raku>

    1.  spots example
    
        1.  schema: /home/doom/End/Cave/GraphVizDbiGeneral/Wall/graphs/schema<sub>diagram.png</sub>
        
            1.  generated with: /home/doom/End/Cave/GraphVizDbiGeneral/bin/generate<sub>schema</sub><sub>diagram</sub><sub>spots</sub>
        
        2.  <https://github.com/doomvox/raku-study/tree/main/bin/2021may30/spots_data_container_class.raku>


<a id="orgbf1980e"></a>

### unusual argument passing signatures (joe brenner)

1.  /home/doom/End/Cave/Ice/Xtal/Perl6/passing<sub>args.org</sub>

2.  /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021may02/mixing<sub>named</sub><sub>args</sub><sub>and</sub><sub>positional</sub><sub>ones.raku</sub>


<a id="org83b5560"></a>

### bruce gray rosettacode

1.  <http://rosettacode.org/wiki/Coprime_triplets#Raku>

2.  <https://rosettacode.org/wiki/Tree_from_nesting_levels#Raku>


<a id="org2048fd7"></a>

### super flat

1.  <https://stackoverflow.com/questions/67515479/what-is-a-simple-and-elegant-way-to-flatten-lists-or-arrays-of-arbitrary-depths>

2.  <https://stackoverflow.com/questions/41648119/how-can-i-completely-flatten-a-list-of-lists-of-lists>

3.  <https://en.wikipedia.org/wiki/Superflat>


<a id="orgfac2b47"></a>

### type system: what is accepted by what

1.  is anything ever cast automatically

    1.  when can you Cool


<a id="org19a3547"></a>

### go through my perl5 templates: how much is core raku now?


<a id="org20b9652"></a>

### raku die handlers vs perl5


<a id="org260be63"></a>

### raku idioms

1.  <https://github.com/doomvox/raku-study/blob/main/notes/idioms.org>

    1.  maybe: favor methods over functions?


<a id="orgba97dcc"></a>

## appendix: the usual links


<a id="orgd1a27c5"></a>

### code examples

<https://github.com/doomvox/raku-study/tree/main/bin/2021jun20>


<a id="org6671f9b"></a>

### meeting notes (material from this file)

<https://github.com/doomvox/raku-study/tree/main/notes/meeting_2021jun20.md>


<a id="orgc4602cf"></a>

### SF Perl page, has links to mailing list

<http://sf.pm.org/>


<a id="orge7d6445"></a>

### perl6-users mailing list archive

<https://www.nntp.perl.org/group/perl.perl6.users/>


<a id="org6444485"></a>

## announcments


<a id="orge281b1a"></a>

### next meeting: July 11th


<a id="orgbcb53ec"></a>

### "conference in the clouds" coming up (bruce gray talk, etc)

1.  june 8-10th, $10
